# Working with Pandas

In [1]:
import numpy as np
import pandas as pd

## Data Frame Importation

In [2]:
data_csv = pd.read_csv('prets.csv')
data_csv.head()

,identifiant,ville,CP,revenu,remboursement,duree,type,taux
0,0,TOULOUSE,31100,3669,1130.05,240,immobilier,1.168
1,1,PARIS,75009,5310,240.00,64,automobile,3.701
2,1,PARIS,75009,5310,1247.85,300,immobilier,1.173
3,2,MARSEILLE,13010,1873,552.54,240,immobilier,0.972
4,3,MARSEILLE,13010,1684,586.03,180,immobilier,1.014

In [3]:
data_json = pd.read_json('prets.json')
data_json.head()

FileNotFoundError: File prets.json does not exist

## Data Frame Methods

In [8]:
dim = data_csv.shape
data_csv.dtypes

identifiant     int64
email          object
nom            object
genre          object
dtype: object

In [10]:
# Transforming data frame into array
clients_array = data_csv.values
print(type(clients_array))

<class 'numpy.ndarray'>

## Data Frame Manipulation

In [13]:
# Indexing Data Frame by column
# Returns a Pandas Series Object
emails = data_csv['email']
names = data_csv['nom']
new_dataFrame = data_csv[['nom','email']]

print(type(emails))
print(type(new_dataFrame))
new_dataFrame.head()

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

                nom                      email
0  Laurent Dagenais  LaurentDagenais@rhyta.com
1        Guy Marois      GuyMarois@fleckens.hu
2   Beaufort Lesage  BeaufortLesage@einrot.com
3    Russell Durand  RussellDurand@armyspy.com
4       Alexis Riel       AlexisRiel@rhyta.com

In [37]:
# Modifying the values inside columns
new_dataFrame = data_csv.copy()
new_dataFrame['identifiant']=1
# Assigning a random number float or integer
new_dataFrame['identifiant']=np.random.rand(clients_array.shape[0],1)
new_dataFrame['identifiant']= np.random.randint(1,10,clients_array.shape[0])
new_dataFrame.tail()

     identifiant                            email                nom genre
223            8  ClaudeDandonneau@jourrapide.com  Claude Dandonneau     F
224            9    ApollineMichaud@superrito.com   Apolline Michaud     F
225            2       PascalineBeaudry@rhyta.com  Pascaline Beaudry     F
226            2     FleurCaouette@jourrapide.com     Fleur Caouette     F
227            9      FrancisMasse@jourrapide.com      Francis Masse     M

In [39]:
# Adding a new column
new_dataFrame = data_csv.copy()
new_dataFrame['id'] = new_dataFrame['identifiant']
new_dataFrame.tail()

,identifiant,email,nom,genre,id
223,223,ClaudeDandonneau@jourrapide.com,Claude Dandonneau,F,223
224,224,ApollineMichaud@superrito.com,Apolline Michaud,F,224
225,225,PascalineBeaudry@rhyta.com,Pascaline Beaudry,F,225
226,226,FleurCaouette@jourrapide.com,Fleur Caouette,F,226
227,227,FrancisMasse@jourrapide.com,Francis Masse,M,227

In [41]:
# Deleting a column
new_dataFrame = data_csv.copy()
new_dataFrame.drop(columns='identifiant') # does not modify the object
new_dataFrame.pop('identifiant') # does modify the object
new_dataFrame.tail()

                               email                nom genre
223  ClaudeDandonneau@jourrapide.com  Claude Dandonneau     F
224    ApollineMichaud@superrito.com   Apolline Michaud     F
225       PascalineBeaudry@rhyta.com  Pascaline Beaudry     F
226     FleurCaouette@jourrapide.com     Fleur Caouette     F
227      FrancisMasse@jourrapide.com      Francis Masse     M

In [69]:
# Renaming a column
new_dataFrame = data_csv.copy()
new_dataFrame = new_dataFrame.rename(columns={'identifiant': 'ide','email': 'em'})
# Changing the type of a column
new_dataFrame['ide'] = new_dataFrame['ide'].astype(float)
new_dataFrame.dtypes

ide      float64
em        object
nom       object
genre     object
dtype: object

In [73]:
# Sorting by columns or values
data_csv.sort_values('email',inplace=True)
data_csv.sort_values('email',ascending=True)
display(data_csv.loc[0:5,:])
display(data_csv.iloc[0:5,:])

     identifiant                      email               nom genre
0              0  LaurentDagenais@rhyta.com  Laurent Dagenais     M
193          193    LealaLemelin@dayrep.com     Leala Lemelin     F
5              5      LeonLapresse@cuvox.de     Leon Lapresse     M

     identifiant                         email               nom genre
13            13  AcelineHughes@jourrapide.com    Aceline Hughes     F
135          135     AdelaideBrousse@gustr.com  Adelaide Brousse     F
189          189        AdeleClavette@cuvox.de    Adele Clavette     F
15            15      AgateGrandbois@gustr.com   Agate Grandbois     F
180          180          AgnesBriard@cuvox.de      Agnes Briard     F

## Filtering Data Frames

In [75]:
# Selection by numerical indices using iloc
data_csv.iloc[:10, 2]
data_csv.iloc[10:20, 1:3]
data_csv.iloc[-10:,1:3]

                           email                 nom
168      VoletaAdler@armyspy.com        Voleta Adler
192  XarlesCaisse@jourrapide.com       Xarles Caisse
214     YoletteLanoie@dayrep.com      Yolette Lanoie
158     YoletteMoreau@dayrep.com      Yolette Moreau
18     YseultCharest@armyspy.com      Yseult Charest
64          YvetteDAvis@cuvox.de       Yvette D Avis
174  ZacharieDuplessis@rhyta.com  Zacharie Duplessis
100  ZdenekVadnais@superrito.com      Zdenek Vadnais
112         ZoeLeclair@gustr.com         Zoe Leclair
53       ZurieTheberge@gustr.com      Zurie Theberge

In [100]:
# Selection by conditions using iloc
pds = (data_csv["genre"]=="F")
data_csv.loc[pds, :]
pds = (data_csv["identifiant"]>=10)
data_csv.loc[pds, ["email"]]

                               email
10      ByronLefebvre@jourrapide.com
11            FlorusDevoe@einrot.com
12      NormandArsenault@armyspy.com
13      AcelineHughes@jourrapide.com
14      GastonBrisette@superrito.com
..                               ...
223  ClaudeDandonneau@jourrapide.com
224    ApollineMichaud@superrito.com
225       PascalineBeaudry@rhyta.com
226     FleurCaouette@jourrapide.com
227      FrancisMasse@jourrapide.com

[218 rows x 1 columns]

## Data Frames Aggregation and Fusion

In [148]:
# Loading
data = pd.read_csv("Data/prets.csv")
data.tail()

,identifiant,ville,CP,revenu,remboursement,duree,type,taux
239,224,PARIS,75008,5118.0,1248.79,300,immobilier,1.206
240,224,PARIS,75008,5118.0,238.20,25,automobile,3.423
241,225,BORDEAUX,33100,2356.0,876.43,180,immobilier,1.172
242,226,PARIS,75002,5098.0,2910.96,240,immobilier,1.140
243,227,PARIS,75015,2348.0,434.38,300,immobilier,1.157

In [170]:
# Data Frame Aggregation
data1 = data.groupby('ville').sum()
print(data1)
data2 = data.groupby(['ville','type'])['revenu'].mean()
print(data2)
data3 = data.groupby(['ville', 'type'])['remboursement'].sum()
print(data3)

           identifiant       CP    revenu  remboursement  duree  \
ville
BORDEAUX          1718   531800   50816.0       15330.59   3660
LYON              2833  1932134   95354.0       26064.67   6251
MARSEILLE         7946   975732  145926.0       40895.72  16420
NICE              2375   129100   85288.0       23544.24   4460
PARIS             9849  5776019  335459.0       94052.61  16686
TOULOUSE          3162   843300   75617.0       19286.18   5643

                                                        type     taux
ville
BORDEAUX   immobilierimmobilierimmobilierimmobilierimmobi...   18.767
LYON       immobilierimmobilierimmobilierimmobilierimmobi...   38.918
MARSEILLE  immobilierimmobilierimmobilierimmobilierimmobi...   92.538
NICE       immobilierimmobilierimmobilierimmobilierimmobi...   27.706
PARIS      automobileimmobilierimmobilierimmobilierimmobi...  100.073
TOULOUSE   immobilierimmobilierimmobilierimmobilierimmobi...   38.217
ville      type
BORDEAUX   immobilier    3176.000000
LYON       automobile    3843.666667
           immobilier    3352.920000
MARSEILLE  automobile    1947.333333
           immobilier    1945.611111
NICE       automobile    3803.500000
           immobilier    4088.473684
PARIS      automobile    4566.800000
           immobilier    4342.013889
TOULOUSE   automobile    2601.000000
           immobilier    2825.583333
Name: revenu, dtype: float64
ville      type
BORDEAUX   immobilier    15330.59
LYON       automobile      788.80
           immobilier    25275.87
MARSEILLE  automobile      839.60
           immobilier    40056.12
NICE       automobile      612.80
           immobilier    22931.44
PARIS      automobile     1426.60
           immobilier    92626.01
TOULOUSE   automobile      718.80
           immobilier    18567.38
Name: remboursement, dtype: float64

In [128]:

print(data2)

# Multiple Aggregation
agg= data.groupby('ville').agg({'remboursement': ['sum', 'mean'],
    'revenu': 'max'})

In [39]:
# Data Frame joint
print(prets.shape)
print(clients.shape)
pd.merge(prets,clients,on='identifiant')

(244, 8)
(228, 4)

,identifiant,ville,CP,revenu,remboursement,duree,type,taux,email,nom,genre
0,0,TOULOUSE,31100,3669.0,1130.05,240,immobilier,1.168,LaurentDagenais@rhyta.com,Laurent Dagenais,M
1,1,PARIS,75009,5310.0,240.00,64,automobile,3.701,GuyMarois@fleckens.hu,Guy Marois,M
2,1,PARIS,75009,5310.0,1247.85,300,immobilier,1.173,GuyMarois@fleckens.hu,Guy Marois,M
3,2,MARSEILLE,13010,1873.0,552.54,240,immobilier,0.972,BeaufortLesage@einrot.com,Beaufort Lesage,M
4,3,MARSEILLE,13010,1684.0,586.03,180,immobilier,1.014,RussellDurand@armyspy.com,Russell Durand,M
...,...,...,...,...,...,...,...,...,...,...,...
239,224,PARIS,75008,5118.0,1248.79,300,immobilier,1.206,ApollineMichaud@superrito.com,Apolline Michaud,F
240,224,PARIS,75008,5118.0,238.20,25,automobile,3.423,ApollineMichaud@superrito.com,Apolline Michaud,F
241,225,BORDEAUX,33100,2356.0,876.43,180,immobilier,1.172,PascalineBeaudry@rhyta.com,Pascaline Beaudry,F
242,226,PARIS,75002,5098.0,2910.96,240,immobilier,1.140,FleurCaouette@jourrapide.com,Fleur Caouette,F
243,227,PARIS,75015,2348.0,434.38,300,immobilier,1.157,FrancisMasse@jourrapide.com,Francis Masse,M